Repository: exco/EXCO-Free-School-Open-Drupal-Distribution
Catalog: modules/captcha/translations/*.po
Languages: lt

source: none
lt: joks

source: Form protection
lt: Formos apsauga

source: Select the challenge type you want for each of the listed forms (identified by their so called <em>form_id</em>'s). You can easily add arbitrary forms with textfield at the bottom of the table or with the help of the '%CAPTCHA_admin_links' option below.
lt: Pasirinkite jūsų norimą užduotį kiekvienai išvardintai formai (atpažįstamai pagal jos <em>form_id</em> identifikatorių). Jūs galite lengvai pridėti reikiamas formas naudodamiesi lentelės apačioje esančiu laukeliu arba žemiau esančiu „%CAPTCHA_admin_links“ nustatymu.

source: Add CAPTCHA administration links to forms
lt: Pridėti CAPTCHA užduoties administravimo nuorodas prie formų

source: delete
lt: šalinti

source: This option is very helpful to enable/disable challenges on forms. When enabled, users with the "%admincaptcha" permission will see CAPTCHA administration links on all forms (except on administrative pages, which shouldn't be accessible to untrusted users in the first place). These links make it possible to enable a challenge of the desired type or disable it.
lt: Šis pasirinkimas leidžia patogiai formoms įjungti ar išjungti bei parinkti CAPTCHA užduotis. Kai įjungta, naudotojai su leidimu „%admincaptcha“ matys CAPTCHA administravimo nuorodas prie kiekvienos formos (išskyrus administravimo puslapius, kurie apskritai neturėtų būti prieinami nepatikimiems naudotojams).

source: administer CAPTCHA settings
lt: administruoti CAPTCHA užduočių nustatymus

source: Challenge description
lt: Užduoties aprašymas

source: With this description you can explain the purpose of the challenge to the user.
lt: Šis aprašymas padės vartotojams suprasti užduoties tikslą.

source: For language %lang_name (code %lang_code)
lt: Kalba %lang_name (kodas %lang_code)

source: Persistence
lt: Veikimas

source: Always add a challenge.
lt: Visuomet pridėti užduotį.

source: Omit challenges for a form once the user has successfully responded to a challenge for that form.
lt: Nerodyti užduoties prie formos, kuomet naudotojas jau sėkmingai išsprendė užduotį tai formai.

source: Omit challenges for all forms once the user has successfully responded to a challenge.
lt: Nerodyti užduočių prie visų formų, kuomet naudotojas jau sėkmingai išsprendė užduotį.

source: Define if challenges should be omitted during the rest of a session once the user successfully responses to a challenge.
lt: Nurodykite, ar užduotys neturėtų būti rodomos likusį sesijos laiką, jei naudotojas sėkmingai išsprendžia užduotį.

source: Log wrong responses
lt: Įrašyti neteisingus atsakymus

source: Report information about wrong responses to the !log.
lt: Pranešti apie neteisingus atsakymus !log.

source: log
lt: žurnale

source: Save configuration
lt: Įrašyti konfigūraciją

source: Challenge type (module)
lt: Užduotis (modulis)

source: Operations
lt: Veiksmai

source: Illegal form_id
lt: Negalimas form_id

source: Added CAPTCHA point.
lt: Kitų formų CAPTCHA užduotis pridėta.

source: The CAPTCHA settings were saved.
lt: CAPTCHA užduočių nustatymai išsaugoti.

source: Form ID
lt: Formos ID

source: The Drupal form_id of the form to add the CAPTCHA to.
lt: Drupal form_id identifikatorius formos, prie kurios pridėti CAPTCHA užduotį.

source: Challenge type
lt: Užduotis

source: The CAPTCHA type to use for this form
lt: CAPTCHA užduotis, naudojama šiai formai

source: Save
lt: Saugoti

source: Saved CAPTCHA point settings.
lt: Kitų formų CAPTCHA užduočių nustatymai išsaugoti.

source: Are you sure you want to delete the CAPTCHA for form_id %form_id?
lt: Ar jūs esate įsitikinę, jog norite pašalinti CAPTCHA užduotį formai, kurios ID yra %form_id?

source: Delete
lt: Pašalinti

source: Are you sure you want to disable the CAPTCHA for form_id %form_id?
lt: Ar jūs esate įsitikinę, jog norite išjungti CAPTCHA užduotį formai, kurios ID yra %form_id?

source: Disable
lt: Išjungti

source: Deleted CAPTCHA for form %form_id.
lt: Pašalinta formos %form_id CAPTCHA užduotis.

source: Disabled CAPTCHA for form %form_id.
lt: Išjungta formos %form_id CAPTCHA užduotis.

source: This page gives an overview of all available challenge types, generated with their current settings.
lt: Šis puslapis leidžia peržvelgti visas galimas užduotis, sugeneruotas su jų dabartiniais nustatymais.

source: Challenge "%challenge" by module "%module"
lt: Užduotis „%challenge“, kurią suteikia modulis „%module“

source: 10 more examples of this challenge.
lt: 10 papildomų šios užduoties pavyzdžių.

source: "CAPTCHA" is an acronym for "Completely Automated Public Turing test to tell Computers and Humans Apart". It is typically a challenge-response test to determine whether the user is human. The CAPTCHA module is a tool to fight automated submission by malicious users (spamming) of for example comments forms, user registration forms, guestbook forms, etc. You can extend the desired forms with an additional challenge, which should be easy for a human to solve correctly, but hard enough to keep automated scripts and spam bots out.
lt: „CAPTCHA“ yra anglų k. akronimas šiam pavadininimui: „Completely Automated Public Turing test to tell Computers and Humans Apart“. Jis reiškia visiškai automatizuotą viešą Turingo testą, skirtą nustatyti ar vartotojas yra kompiuteris ar žmogus. Dažniausiai tai yra užduotis-atsakymas testas, kuris nustato ar vartotojas yra žmogus. CAPTCHA užduoties modulis yra įrankis padedantis kovoti su automatiniais įrašais, kuriuos padaro blogų tikslų turintys naudotojai, komentarų, naudotojų registravimo, svečių knygos ir kitose formose. Jūs galite prie pasirinktų formų pridėti papildomą užduotį, kuri žmonėms turėtų būti lengvai teisingai išsprendžiama, bet pakankamai sudėtinga automatizuotiems scenarijams ir šlamštą platinantiems botams.

source: Display on separate page
lt: Rodyti atskirame puslapyje

source: CAPTCHA is a trademark of Carnegie Mellon University.
lt: CAPTCHA yra Carnegie Mellon University prekinis ženklas.

source: skip CAPTCHA
lt: praleisti CAPTCHA užduotį

source: This question is for testing whether you are a human visitor and to prevent automated spam submissions.
lt: Šis klausimas yra skirtas įsitikinti, jog jūs esate žmogus, ir sustabdyti automatinį šlamšto siuntimą.

source: CAPTCHA: "@type" enabled
lt: CAPTCHA užduotis: „@type“ įjungta

source: Untrusted users will see a CAPTCHA here (!settings).
lt: Nepatikimi naudotojai čia matys CAPTCHA užduotį (!settings).

source: general CAPTCHA settings
lt: bendri CAPTCHA užduoties nustatymai

source: Enabled challenge
lt: Užduotis įjungta

source: change
lt: keisti

source: disable
lt: išjungti

source: CAPTCHA: no challenge enabled
lt: CAPTCHA užduotis: nėra įjungtų užduočių

source: Place a CAPTCHA here for untrusted users.
lt: Čia rodyti CAPTCHA užduotį nepatikimiems naudotojams.

source: CAPTCHA test failed (unknown csid).
lt: CAPTCHA užduoties bandymas nepavyko (nežinomas csid).

source: The answer you entered for the CAPTCHA was not correct.
lt: Jūsų įvestas CAPTCHA užduoties atsakymas buvo neteisingas.

source: Math Question
lt: Matematinis uždavinys

source: Solve this simple math problem and enter the result. E.g. for 1+3, enter 4.
lt: Išspręskite šią paprastą matematinę užduotį ir įveskite atsakymą. Pvz., jei užduotis yra 1+3, įveskite 4.

source: Already @counter blocked form submissions
lt: Jau sulaikyta @counter bandymų įrašyti formas.

source: %form_id post blocked by CAPTCHA module: challenge "%challenge" (by module "%module"), user answered "%response", but the solution was "%solution".
lt: %form_id įrašas užblokuotas CAPTCHA modulio: užduotis „%challenge“ (modulis „%module“), naudotojas atsakė „%response“, bet sprendimas buvo „%solution“.

source: Administer how and where CAPTCHAs are used.
lt: Nustatykite kur ir kada naudoti CAPTCHA užduotis.

source: General settings
lt: Bendri nustatymai

source: Examples
lt: Pavyzdžiai

source: An overview of the available challenge types with examples.
lt: Galimų užduočių su pavyzdžiais apžvalga.

source: CAPTCHA point administration
lt: Kitų formų CAPTCHA užduočių administravimas

source: This table describes which challenges should be added to which forms.
lt: Ši lentelė nusako, kokia užduotis turėtų būti pridėta prie kokios formos.

source: The form_id of the form to add a CAPTCHA to.
lt: Drupal form_id identifikatorius formos, prie kurios pridėti CAPTCHA užduotį.

source: The module that provides the challenge.
lt: Modulis, suteikiantis užduotį.

source: The challenge type to use.
lt: Užduoties tipas.

source: Stores the data about CAPTCHA sessions (solution, IP address, timestamp, ...).
lt: Saugo informaciją apie CAPTCHA užduoties sesijas (sprendimas, IP adresas, laiko žymė, ...).

source: CAPTCHA session ID.
lt: CAPTCHA užduoties sesijos ID.

source: User's {users}.uid.
lt: Naudotojo {users}.uid.

source: Session ID of the user.
lt: Naudotojo sesijos ID.

source: IP address of visitor.
lt: Lankytojo IP adresas.

source: A Unix timestamp indicating when the challenge was generated.
lt: UNIX laikas, kuomet užduotis buvo sugeneruota.

source: The form_id of the form where the CAPTCHA is added to.
lt: Drupal form_id identifikatorius formos, prie kurios pridedama CAPTCHA užduotis.

source: Solution of the challenge.
lt: Užduoties sprendimas.

source: Status of the CAPTCHA session (unsolved, solved, ...)
lt: CAPTCHA užduoties sesijos būsena (neišspręsta, išspręsta, ...)

source: The number of attempts.
lt: Bandymų skaičius.

source: You can now <a href="!captcha_admin">configure the CAPTCHA module</a> for your site.
lt: Dabar jūs galite <a href="!captcha_admin">sukonfigūruoti CAPTCHA užduoties modulį</a> savo svetainei.

source: Unsupported database.
lt: Nepalaikoma duomenų bazė.

source: IP address of the visitor.
lt: Lankytojo IP adresas.

source: Base CAPTCHA module for adding challenges to arbitrary forms.
lt: Pagrindinis CAPTCHA užduoties modulis, leidžiantis pridėti užduotis prie pasirinktų formų.

source: Spam control
lt: Šlamšto kontrolė

source: Built-in font
lt: Vidinis šriftas

source: Images cannot be generated, because your PHP installation's GD library has no JPEG support.
lt: Paveikslėliai negali būti generuojami, nes jūsų PHP paketo GD biblioteka neturi JPEG formato palaikymo.

source: Code settings
lt: Kodo nustatymai

source: Characters to use in the code
lt: Kode naudojami rašmenys

source: Code length
lt: Kodo ilgis

source: The code length influences the size of the image. Note that larger values make the image generation more CPU intensive.
lt: Kodo ilgis daro įtaką paveikslėlio dydžiui. Reikia pastebėti, kad didesnės reikšmės reiškia daugiau darbo procesoriui generuojant paveikslėlius.

source: Case insensitive validation
lt: Tikrinant sprendimą nepaisyti raidžių registro

source: Enable this option to ignore uppercase/lowercase errors in the response. This can be usefull for certain target audiences or fonts.
lt: Įjunkite šį nustatymą, kad nebūtų skiriamos didžiosios ir mažosios raidės atsakyme. Tai gali būti naudinga kai kurioms naudotojų grupėms ir šriftams.

source: Font settings
lt: Šrifto nustatymai

source: Font
lt: Šriftas

source: The TrueType font (.ttf) to use for the text in the image CAPTCHA.
lt: TrueType šriftas (.ttf), naudojamas tekstui vaizdinėje CAPTCHA užduotyje.

source: Font size
lt: Šrifto dydis

source: tiny
lt: mažytis

source: small
lt: mažas

source: normal
lt: normalus

source: large
lt: didelis

source: The font size influences the size of the image. Note that larger values make the image generation more CPU intensive.
lt: Šrifto dydis daro įtaką paveikslėlio dydžiui. Reikia pastebėti, kad didesnis paveikslėlis reiškia daugiau darbo procesoriui generuojant jį.

source: Character spacing
lt: Tarpų plotis tarp simbolių

source: Define the average spacing between characters. Note that larger values make the image generation more CPU intensive.
lt: Nustatykite vidutinį tarpą tarp simbolių. Reikia pastebėti, kad didesnis paveikslėlis reiškia daugiau darbo procesoriui generuojant jį.

source: Color settings
lt: Spalvų nustatymai

source: Configuration of the background and text colors in the image CAPTCHA.
lt: Fono ir teksto spalvų vaizdinėje CAPTCHA užduotyje konfigūravimas.

source: Background color
lt: Fono spalva

source: Enter the hexadecimal code for the background color (e.g. #FFF or #FFCE90).
lt: Įveskite šešioliktainį fono spalvos kodą, pvz., #FFF ar #FFCE90.

source: Text color
lt: Teksto

source: Enter the hexadecimal code for the text color (e.g. #000 or #004283).
lt: Įveskite šešioliktainį teksto spalvos kodą, pvz., #000 ar #004283.

source: Additional variation of text color
lt: Papildomas teksto spalvos variavimas

source: moderate
lt: vidutinis

source: high
lt: aukštas

source: very high
lt: labai aukštas

source: The different characters will have randomized colors in the specified range around the text color.
lt: Skirtingi simboliai turės atsitiktines spalvas, parenkamas iš panašių į nurodytą teksto spalvą.

source: Distortion and noise
lt: Iškraipymas ir triukšmas

source: With these settings you can control the degree of obfuscation by distortion and added noise. Do not exaggerate the obfuscation and assure that the code in the image is reasonably readable. For example, do not combine high levels of distortion and noise.
lt: Šiuo nustatymu jūs galite valdyti apgadinimo lygį iškraipant ir pridedant triukšmą. Nepersistenkite su apgadinimu ir įsitikinkite, kad kodas yra perskaitomas. Pvz., kartu nenaudokite aukštų iškraipymo ir triukšmo lygių.

source: Distortion level
lt: Iškraipymo lygis

source: low
lt: žemas

source: severe
lt: milžiniškas

source: Set the degree of wave distortion in the image.
lt: Nustatykite paveikslėlio iškraipymo bangelėmis lygį.

source: Smooth distortion
lt: Išlyginimo iškraipymas

source: This option enables bilinear interpolation of the distortion which makes the image look smoother, but it is more CPU intensive.
lt: Šis nustatymas įjungia „bilinear“ iškraipymų interpoliaciją. Tai paveikslėlį daro glotnesnį, bet labiau apkrauna procesorių

source: Double vision
lt: Dvejinimas

source: Add salt and pepper noise
lt: Druskos ir pipirų triukšmas

source: This option adds randomly colored point noise.
lt: Šis nustatymas prideda atsitiktinės spalvos taškinį triukšmą.

source: Add line noise
lt: Linijinis triukšmas

source: This option enables lines randomly drawn on top of the text code.
lt: Šis nustatymas įjungia ant tekstinio kodo atsitiktinai piešiamas linijas.

source: Noise level
lt: Triukšmo lygis

source: The image CAPTCHA module works best with a TrueType font file (TTF) for generating the images, but because of licencing issues it is not allowed to package fonts with the module. A simple built-in bitmap font is provided as default instead. You can install TrueType fonts yourself by putting them in the fonts directory of the image CAPTCHA module (directory "%fontsdir") or by uploading them to your Drupal file system (directory "%filesdir") with for example the upload module.
lt: Vaizdinės CAPTCHA užduoties modulis geriausiai veikia su su TrueType šriftų failais (TTF) paveikslėlių generavimui, bet dėl licencijavimo ypatybių negalima šriftų platinti kartu su moduliu. Vietoje to paprastas taškinės grafikos šriftas yra pridedamas kaip numatytas. Jūs patys galite įdiegti TrueType šriftus padėdami juos vaizdinės CAPTCHA užduoties modulio šriftų aplanke „%fontsdir“ arba atsiųsdami juos į jūsų Drupal failų sistemos aplanką „%filesdir“ pasinaudoję atsiuntimo moduliu.

source: The usage of the built-in bitmap font it is not recommended because of its small size and missing UTF-8 support.
lt: Nerekomenduojama naudoti pateikiamą taškinės grafikos šriftą dėl jo mažo dydžio ir UTF-8 nepalaikymo.

source: The list of characters to use should not contain spaces.
lt: Rašmenų sąraše neturi būti tarpų.

source: You need to select a font
lt: Jūs turite pasirinkti šriftą

source: Font does not exist or is not readable.
lt: Šriftas neegzistuoja ar yra neperskaitomas.

source: Background color is not a valid hexadecimal color value.
lt: Fono spalva nėra galima šešioliktainė spalvos vertė.

source: Text color is not a valid hexadecimal color value.
lt: Teksto spalva nėra galima šešioliktainė spalvos vertė.

source: Generation of image CAPTCHA failed. Check your image CAPTCHA configuration and especially the used font.
lt: Vaizdinės CAPTCHA užduoties generavimas nepavyko. Patikrinkite savo vaizdinės CAPTCHA užduoties konfigūraciją, atkreipkite dėmesį į naudojamus šriftus.

source: The image CAPTCHA is a popular challenge where a random textual code is obfuscated in an image. The image is generated on the fly for each request, which is rather CPU intensive for the server. Be careful with the size and computation related settings.
lt: Vaizdinė CAPTCHA užduotis, kur atsitiktinis tekstinis kodas yra apgadinamas paveikslėlyje, yra labai plačiai naudojama. Paveikslėlis yra sugeneruojamas kiekvienai užklausai, dėl to tai gana stipriai apkrauna serverio procesorių. Būkite atsargūs su dydžio ir skaičiavimų nustatymais.

source: Example image, generated with the current settings:
lt: Paveikslėlio pavyzdys, sugeneruotas naudojant dabartinius nustatymus:

source: Enter the characters (without spaces) shown in the image.
lt: Įveskite paveikslėlyje esančius simbolius be tarpų.

source: Enter the characters shown in the image. Ignore spaces and be careful about upper and lower case.
lt: Įveskite paveikslėlyje esančius simbolius. Tarpų nepaisykite ir būkite atidūs su didžiosiomis ir mažosiomis raidėmis.

source: Image CAPTCHA
lt: Vaizdinė CAPTCHA užduotis

source: What code is in the image?
lt: Koks kodas yra paveikslėlyje?

source: Encountered an illegal byte while splitting an utf8 string in characters.
lt: Prieitas negalimas baitas dalijant UTF8 simbolių eilutę į simbolius.

source: Provides an image based CAPTCHA.
lt: Suteikia vaizdinę CAPTCHA užduotį.
