Repository: exco/EXCO-Free-School-Open-Drupal-Distribution
Catalog: modules/mimemail/translations/*.po
Languages: fr

source: Email settings
fr: Paramètres e-mail

source: Plaintext email only
fr: E-mail en texte brut seulement

source: Check this option if you do not wish to receive email messages with graphics and styles
fr: Cochez cette case si vous ne souhaitez pas recevoir de messages e-mail avec des images et des styles

source: Default mailing engine using drupal_mail().
fr: Moteur d' e-mail par défaut utilisant drupal_mail().

source: HTML E-mail settings
fr: Paramètres des E-mails HTML

source: E-mail with HTML and attachments
fr: E-mail avec HTML et pièces jointes

source: Mail
fr: E-mail

source: Converts CSS to inline styles in an html message. Requires PHP 5.x
fr: Convertit le CSS en styles en ligne dans un message html. Nécessite PHP 5.x

source: E-mail address
fr: Adresse e-mail

source: A valid e-mail address for this website, used by the auto-mailer during registration, new password requests, notifications, etc.
fr: Une adresse e-mail valide pour ce site, utilisée dans les mails automatiques envoyés aux utilisateurs lors de leur enregistrement, demandes de nouveau mot de passe, notifications, etc.

source: Use mime mail for all messages
fr: Utiliser mime mail pour tous les messages

source: Use the mime mail module to deliver all site messages. With this option, system emails will have styles and formatting
fr: Utiliser le module mimemail pour envoyer tous les messages du site. Avec cette option, les e-mails système auront un formatage html et des styles

source: This option disables the use of email messages with graphics and styles. All messages will be converted to plain text.
fr: Cette option désactive l'utilisation de messages e-mail avec images et styles. Tous les messages seront convertis en texte brut.

source: Advanced Settings
fr: Paramètres Avancés

source: Process incoming messages posted to this site
fr: Traiter les messages entrants postés sur ce site

source: This is an advanced setting that should not be enabled unless you know what you are doing
fr: Ceci est un paramètre avancé qui ne doit être activé que si vous êtes sûr de ce que vous faites

source: Message validation string
fr: Chaîne de caractères de validation de message

source: This string will be used to validate incoming messages. It can be anything, but must be used on both sides of the transfer
fr: Cette chaîne sera utilisée pour valider les messages entrants. Cela peut-être n'importe quoi, mais elle doit être utilisée de chaque côté du transfert

source: E-mail engine
fr: Moteur d'e-mail

source: Choose an e-mail engine for sending mails from your site.
fr: Choisissez un moteur d'e-mail pour envoyer des e-mails depuis votre site.

source: Engine specific settings
fr: Réglages spécifiques du moteur d'e-mail

source: Please choose a mail engine.
fr: Veuillez choisir un moteur d' e-mail

source: access denied
fr: accès refusé

source: Authentication error for POST e-mail
fr: Erreur d'authentification pour un e-mail POST

source: Converts CSS to inline styles in an HTML message. Requires PHP 5.x and the DOM extension
fr: Convertit les CSS en styles en ligne dans les messages HTML. Nécessite PHP 5.x et l'extension DOM
